<a href="https://colab.research.google.com/github/aryadeo/python_basics/blob/master/attendance/attendance_test_code.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [79]:
import numpy as np
import pandas as pd

In [80]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [81]:
my_file=pd.read_csv('/content/drive/My Drive/name_data.csv',index_col=0).iloc[:,:]

In [82]:
my_file

           Date  Entry
name
Shyam        12   9.45
arya         13   6.32
Shakti       45  10.45
Subhasini    65  11.20
Madhu        78  12.10
Mukesh        9   6.50

In [83]:
my_file['EXit']=0

In [84]:
my_file

           Date  Entry  EXit
name
Shyam        12   9.45     0
arya         13   6.32     0
Shakti       45  10.45     0
Subhasini    65  11.20     0
Madhu        78  12.10     0
Mukesh        9   6.50     0

In [85]:
if 'Shyam' in my_file.index:
  my_file.at['Shyam','EXit']=10

In [86]:
my_file

           Date  Entry  EXit
name
Shyam        12   9.45    10
arya         13   6.32     0
Shakti       45  10.45     0
Subhasini    65  11.20     0
Madhu        78  12.10     0
Mukesh        9   6.50     0